# SQLite

In [1]:
import sqlite3
con = sqlite3.connect("week3.sqlite", isolation_level=None)
cur = con.cursor()

Data types in SQLite  
https://www.sqlite.org/datatype3.html

In [21]:
cur.execute("""DROP TABLE IF EXISTS movies""")

In [52]:
q = """
CREATE TABLE IF NOT EXISTS movies (
    id INTEGER PRIMARY KEY,
    title TEXT,
    year INTEGER,
    rating FLOAT,
    is_watched BOOLEAN DEFAULT 0,
    created_at DATETIME DEFAULT CURRENT_TIMESTAMP,
    updated_at DATETIME DEFAULT CURRENT_TIMESTAMP
)
"""
cur.execute(q)

In [54]:
# Check if the table is created
q = """
SELECT
    *
FROM
    sqlite_master
"""
res = cur.execute(q)

In [55]:
res.fetchone()

('table',
 'movies',
 'movies',
 2,
 'CREATE TABLE movies (\n    id INTEGER PRIMARY KEY,\n    title TEXT,\n    year INTEGER,\n    rating FLOAT,\n    is_watched BOOLEAN DEFAULT 0,\n    created_at DATETIME DEFAULT CURRENT_TIMESTAMP\n)')

In [48]:
q = """
INSERT INTO movies (
    title, 
    year, 
    rating
    ) VALUES (?, ?, ?)
"""

cur.execute(q, ("The Matrix", 1999, 5.0))
res.fetchall()

[]

In [49]:
cur.execute(q, ("Forrest Gump", 1994, 3.5))

In [56]:
res = [x for x in cur.execute("""SELECT * FROM movies""")]
# compared with fetchall this command only read one line at a time
for row in res:
    print(row)

(1, 'The Matrix', 1999, 5.0, 0, '2024-01-23 23:17:51')
(2, 'The Matrix', 1999, 5.0, 0, '2024-01-23 23:19:14')
(3, 'Forrest Gump', 1994, 3.5, 0, '2024-01-23 23:19:16')
(4, 'The Matrix', 1999, 5.0, 0, '2024-01-23 23:24:11')
(5, 'The Matrix', 1999, 5.0, 0, '2024-01-23 23:24:36')
(6, 'The Matrix', 1999, 5.0, 0, '2024-01-23 23:25:11')
(7, 'The Matrix', 1999, 5.0, 0, '2024-01-23 23:25:26')
(8, 'The Matrix', 1999, 5.0, 0, '2024-01-23 23:31:27')
(9, 'Forrest Gump', 1994, 3.5, 0, '2024-01-23 23:31:30')
(10, 'Monty Python Live at the Hollywood Bowl', 1982, 5.0, 0, '2024-01-23 23:31:37')
(11, "Monty Python's The Meaning of Life", 1983, 4.5, 0, '2024-01-23 23:31:37')
(12, "Monty Python's Life of Brian", 1979, 3.9, 0, '2024-01-23 23:31:37')
(13, 'The Matrix', 1999, 5.0, 0, '2024-01-23 23:33:01')
(14, 'Forrest Gump', 1994, 3.5, 0, '2024-01-23 23:33:03')
(15, 'Monty Python Live at the Hollywood Bowl', 1982, 5.0, 0, '2024-01-23 23:33:14')
(16, "Monty Python's The Meaning of Life", 1983, 4.5, 0, '2024-01-23 23:33:14')
(17, "Monty Python's Life of Brian", 1979, 3.9, 0, '2024-01-23 23:33:14')

In [58]:
data = [
    ("Monty Python Live at the Hollywood Bowl", 1982, 5.0),
    ("Monty Python's The Meaning of Life", 1983, 4.5),
    ("Monty Python's Life of Brian", 1979, 3.9),
]
cur.executemany(# execute many is used to insert multiple rows at once
    "INSERT INTO movies (title, year, rating) VALUES(?, ?, ?)", 
    data
)

In [47]:
for row in cur.execute("SELECT year, title FROM movies ORDER BY year"):
    print(row)

(1979, "Monty Python's Life of Brian")
(1982, 'Monty Python Live at the Hollywood Bowl')
(1983, "Monty Python's The Meaning of Life")
(1994, 'Forrest Gump')
(1994, 'Forrest Gump')
(1999, 'The Matrix')
(1999, 'The Matrix')
(1999, 'The Matrix')
(1999, 'The Matrix')
(1999, 'The Matrix')
(1999, 'The Matrix')
(1999, 'The Matrix')

# Pandas

In [59]:
import pandas as pd

In [68]:
data= [
    {"name":"Zia"},
    {"name":"Sun"}
]
df = pd.DataFrame(data)

In [69]:
con = sqlite3.connect("week3.sqlite", isolation_level=None)
df.to_sql("people", con, if_exists="replace")

2

In [70]:
df.head()

  name
0  Zia
1  Sun